trade_exp/src/DataProcessors/ОчередьВодителей/ОчередьВодителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОчередьВодителей</name>
</mdclass:DataProcessor>

trade_exp/src/InformationRegisters/СтатусыВодителей/СтатусыВодителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="818744fb-c386-43c6-9019-6698d3e9f4c1">
  <name>СтатусыВодителей</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="61d8b056-4dda-43aa-9255-dfb75ae8ffa9">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="81803890-4870-45c0-8271-dd15e272d917">
    <name>Рейс</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="6830df13-090e-4361-a92a-1ce174c899d0">
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="bd34926c-a1c5-4748-a383-a4accb727902">
    <name>ДатаПрибытия</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="78d0e85f-15e5-4da2-9253-fdcdf57ffbd3">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="acd5498b-e41d-4262-8314-d5f756a749c0">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="003bb52b-599e-4135-a3fc-ab735d3f49db">
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/СтатусыВодителей/СтатусыВодителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="80675a86-f1b3-42aa-bbed-b443ea3fba8a">
  <name>СтатусыВодителей</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="24cec108-8195-4aad-a265-e2495c813871">
    <name>Готов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="25759240-bbde-4bc4-8a69-610103245566">
    <name>ВРейсе</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="8b61fd48-1b3f-434a-9f2d-7e7107b62b28">
    <name>НеГотов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="7423ebb7-3eff-4d31-ba72-320c2bd8592c">
    <name>Возвращается</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/СтатусыЗаказовНаДоставку/СтатусыЗаказовНаДоставку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="001dd93b-cd26-4b28-8ae1-9d7129bc2202">
  <name>СтатусыЗаказовНаДоставку</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="1367a921-0ba4-4d75-8d60-7c37522518c2">
    <name>ВРейсе</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/УстановкаСтатусовВодителей/УстановкаСтатусовВодителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="99f0c7c8-eaf0-4c4f-9756-1838f9d692b9">
  <name>УстановкаСтатусовВодителей</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="da9a087c-ce8d-4646-8aa2-1a172ecc5a15">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="08d8472a-b357-4d43-bc3c-88b576fbd1a9">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="adbff1ea-ea9a-4a88-89d4-dbaf35a83198">
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e983d47e-e6da-4d5e-b334-8521a41befb5">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Document>

trade_exp/src/DataProcessors/ОчередьВодителей/Forms/ОчередьВодителей/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекДата = ТекущаяДата();
	
	Список.Параметры.УстановитьЗначениеПараметра("Дата1", НачалоДня(ТекДата));
	Список.Параметры.УстановитьЗначениеПараметра("Дата2", КонецДня(ТекДата));
	Список.Параметры.УстановитьЗначениеПараметра("ПланФакт", Перечисления.ПланФакт.План);
	
	ГрафикНаСегодня.Параметры.УстановитьЗначениеПараметра("Дата1", НачалоДня(ТекДата));
	ГрафикНаСегодня.Параметры.УстановитьЗначениеПараметра("Дата2", КонецДня(ТекДата));
	ГрафикНаСегодня.Параметры.УстановитьЗначениеПараметра("ПланФакт", Перечисления.ПланФакт.План);
	
	СтатусыВодителей.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекДата);
	
	Если Параметры.Свойство("Подразделение") Тогда
		Подразделение= Параметры.Подразделение;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Подразделение", Подразделение, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Подразделение));
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГрафикНаСегодня.Отбор, "Подразделение", Подразделение, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Подразделение));
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СтатусыВодителей.Отбор, "Подразделение", Подразделение, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Подразделение));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	 ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Подразделение", Подразделение, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Подразделение));
	 ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГрафикНаСегодня.Отбор, "Подразделение", Подразделение, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Подразделение));
	 ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СтатусыВодителей.Отбор, "Подразделение", Подразделение, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Подразделение));
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОповеститьОВыборе(Элементы.Список.ТекущиеДанные.Водитель);
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	Элементы.Список.Обновить();
	Элементы.ГрафикНаСегодня.Обновить();
	СтатусыВодителей.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	Элементы.СтатусыВодителей.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтатусВодителя(Команда)
	ТекДанныеТаблицы = Элементы.СтатусыВодителей.ТекущиеДанные;
	Если ТекДанныеТаблицы <> Неопределено Тогда
		ФормаДокументаСтатуса = ПолучитьФорму("Документ.УстановкаСтатусовВодителей.ФормаОбъекта");
		ДанныеФормы = ФормаДокументаСтатуса.Объект;
		ДанныеФормы.Водитель = ТекДанныеТаблицы.Водитель;
		ДанныеФормы.Комментарий = "Ручное изменение";
		
		ФормаДокументаСтатуса.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьТекущегоПользователя()
	Возврат Пользователи.ТекущийПользователь();
КонецФункции

&НаКлиенте
Процедура СтатусыВодителейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущаяСтрока= Элементы.СтатусыВодителей.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.Рейс) Тогда
		ПараметрыОткрытия= Новый Структура;
		ПараметрыОткрытия.Вставить("Ключ", ТекущаяСтрока.Рейс);
		
		ОткрытьФорму("Документ.ЗаданиеНаПеревозкуРейс.ФормаОбъекта", ПараметрыОткрытия, ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СтатусыВодителейПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыВодителейСрезПоследних.Рейс КАК Рейс
		|ПОМЕСТИТЬ ВТ_Рейсы
		|ИЗ
		|	РегистрСведений.СтатусыВодителей КАК СтатусыВодителейСрезПоследних
		|ГДЕ
		|	СтатусыВодителейСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыВодителей.ВРейсе)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаданиеНаПеревозкуРейсОснования.Ссылка КАК Рейс,
		|	ЗаданиеНаПеревозкуРейсОснования.Документ.Номер КАК Заказ
		|ИЗ
		|	Документ.ЗаданиеНаПеревозкуРейс.Основания КАК ЗаданиеНаПеревозкуРейсОснования
		|ГДЕ
		|	ЗаданиеНаПеревозкуРейсОснования.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_Рейсы.Рейс
		|			ИЗ
		|				ВТ_Рейсы)
		|	И ЗаданиеНаПеревозкуРейсОснования.Документ.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовНаДоставку.ВРейсе)
		|ИТОГИ ПО
		|	Рейс";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаРейс = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаРейс.Следующий() Цикл
		
		Рейс = ВыборкаРейс.Рейс;
		СписокЗаказов = "";
		
		Для каждого СтрокаСписка Из Строки Цикл
		
			Если СтрокаСписка.Значение.Данные.Рейс  = Рейс Тогда
				
				ВыборкаЗаказ = ВыборкаРейс.Выбрать();
				
				Пока ВыборкаЗаказ.Следующий() Цикл
					
					Если НЕ СписокЗаказов = "" Тогда
						СписокЗаказов = СписокЗаказов + ", ";
					КонецЕсли;
					
					СписокЗаказов = СписокЗаказов + Строка(ВыборкаЗаказ.Заказ);

				КонецЦикла;
				
				СтрокаСписка.Значение.Данные.СписокЗаказов = СписокЗаказов;
			
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры
